{"pages":[{"title":"About","text":"","link":"/about/index.html"}],"posts":[{"title":"eJPT Certificate Review","text":"大家安，大概在四月中的時候拿到eJPT，在考之前就有發現臺灣沒有任何一篇有關eJPT的心得，想說分享一下順便紀錄一下心得。 先來介紹一下eJPT是什麼，eJPT 全名是 eLearnSecurity Junior Penetration Tester，在國外這幾年越來越多人拿來和CEH、CompTIA Security+…等類似的入門證照拿來做比較，這裡先簡單比較一下我自己對這幾張證照還有其他類似證照的看法，有很多都是從reddit還有youtube上面看來的（畢竟我也沒錢可以全部考），所以我也不確定臺灣實際的狀況甚至是證照考試實際上是如何，所以如果有講錯或造成心情不悅請見諒。想直接看eJPT的心得的可以點這裡或點右邊的Introduction CEH (盤子) Master (CEH + CEH Practical)在各大論壇上最為人詬病的就是其極高的金額，但也不可以就直接否定掉這張證照的價值，因為其證照的內容要是真的讀的滾瓜爛熟，那那個人的確還是會有那個價值，但金額極高（考一次試要 1200 鎂，都可以直接考OSCP了），以及極缺乏在Pentest中最需要的實務經驗，讓這張證照常常被拿來當笑話，不過實務經驗的方面EC-Council也有注意到，便推出CEH Practical，另一張坑錢實務的證照，名字裡面還很明確的標出Practical，就像怕別人不知道這是一個實務的證照一樣，如果考了CEH（MCQ Exam）和CEH Practical，他們就會很貼心的幫你把這張證照變成CEH Master，聽起來真的是很厲害ㄋ。 另外聽說這張證照的實務方面其實也沒到很實務，就是以課程中如果有購買他們課程會送的各種Lab裡頭出題目，雖然這個也是選擇題而且題目會給你提示，但是是需要動手操作工具，才能得到答案，的確是比較實務，但這種實務也是建立在已知的環境下，所以考這證照金額和其帶來的效益，也不能說不好，就見仁見智了。 最後有人會說這張證照是給剛踏入或想踏入Pentest領域最好的證照，這個說法肯定是錯的，只能說是給剛踏入Offensive Security領域的不錯的證照而已。 CompTIA Security+ &amp; Pentest+這兩張證照雖然有時候會被拿來說嘴，但是由於金額偏低，還有課程內容的面向就已經有說清楚是給什麼樣的人（Security+ is for basic cybersecurity knowledge，Pentest+ is for how to conduct pentest），所以蠻常被推薦的，Security+是張不錯的證照，但Pentest+由於是剛出，又有點像CEH，所以有人覺得不太好，這個也是見仁見智了，因為我也沒考過。 最後再進入正文之前推薦一個還不錯的文章。考證照真的沒用嗎？一個從業 20 年的 IT 主管告訴你他怎麼看！ IntroductioneLearnSecurity對eJPT的介紹當初會看到這張證照是因為想考CEH（因為快要畢業加上不確定考不考得上研究所，所以想先拿證照至少可以拿來秀一下當面試加分的東西），然後去爬reddit之後發現有人問到CEH下面每個人幾乎都在推這張，還有一些youtuber也有對這張證照的review，加上價格合理（課程 + 5.5小時的影片 + 16個labs + 3個Black-box的Pentest + 可以重考一次價格500鎂），加上又是給剛入門的考，所以就打算先以這張證照當作CEH的替代品。 不錯的youtuber The Cyber Mentor Cristi Vlad Hackersploit Liveoverflow 課程心得 &amp; 考試心得PTS (Penetration Testing Student)PTS是eLearnSecurity在你買考試的voucher時一起給的，讀熟PTS我敢打包票，一定會拿到證照，畢竟他也是設計來讓你獲得可以取得eJPT的課程。然後Labs會有解答，所以也不用太害怕會做不出來，但是有看slide跟影片，應該就都可以做的出來，16個labs我大概有3個左右是看了解答才知道怎麼做的，另外還有3個Black-box的Pentest，難度跟Labs有差，做不出來也不用太灰心。下面是官網上對PTS的介紹 For absolute beginners in IT Security Minimal pre-requisites Learn about: Routing, Forwarding, and TCP/IP; Information Gathering; Scanning; Vulnerability Assessments; Buffer Overflows; XSS; SQL Injection; System and Network Attacks; and Basics of Web App Pentesting Learn how to: Analyze Traffic with Wireshark, Exploit Vulnerable Hosts, Move Laterally, Manipulate Traffic, Crack Passwords, and Exfiltrate Data Develop Pentesting tools in C and Python Learn how to use tools like Nmap, Nessus, Hydra, Metasploit, and Burp Suite Preparation for the Penetration Testing Professional (PTP) course Obtaining the eJPT certification qualifies you for 40 CPE 考試心得一開始因為過於擔心會考不過加上又有拖延症，所以我總共花了快兩個月才確定是時候考試了，通常用心讀大概花一個多月或20幾天就可以熟讀內容加上Labs大概做兩次，難度大概介於Labs跟Black-box的Pentest，實際上的考法和Black-box一樣，給你一段IP位址外什麼都不會給，考題有20題選擇題，只能錯5題，我自己是19/20，選擇題的題目大概會是（不能講實際的題目出來，官網有明確說不能spoiler） 在某某某文件中有什麼 某人的密碼是什麼 當然題目是英文的，我只4懶ㄉ打英文才打中文ㄉ，另外別肖想透過題目來取得一點在Pentest的想法（跟CEH Practical不一樣），真的要實際把機器compromised後才知道題目在問甚麼以及答案到底是什麼，中間的過程真的得透過自己的想法一步一步來，然後攻下機器。然後有整整3天的時間可以讓你完成考試，所以真的真的真的完全不用擔心會做不完，但是如果你想知道大概多久做完才算正常，大概10小時以內，我自己是7小時，但考慮我讀了快兩個月，7小時真的算很久了，然後去reddit爬文好像都大概5、6小時就結束了，不過也有看到做12小時的，只能說讀的越熟一定會解的更快。然後考試不會像OSCP需要架設攝影機或者限制不能使用自動化工具，考試的過程中你可以想做什麼就做甚麼，唯一不能做的事情就是去PTS的論壇上面問有關考試題目的問題。我在考試時也是非常緊張，因為想到有可能會在過程中遇到解不出來的問題，或者遇到什麼奇怪的事情，因為考前一天想說要考試了，更新一下kali，也沒snapshot，更新完之後一大堆問題，只好回到超級久以前的snapshot，不過雖然eJPT可以隨時考，考試是按下一個按鈕之後就會開始，不像OSCP要先排時間或是CEH要預約之類的，但我想說我都拖兩個月了，再不考可能就會變成拖三個月，所以還是硬著頭皮上了，但實際上也沒那麼困難，雖然中間還是有卡一下，可是想通之後就會覺得那個是超級簡單的問題。 總心得整體來說，以剛入門的人來說，這張真的算是偏簡單的證照，真的很推薦可以考看看，但如果有經驗的，除非是像我一樣快畢業而且身上沒有任何作品，CTF也打的不好，也沒打過HTB的任何一台機器，要考OSCP也考不過的人，我才會推薦考這張，不然時間金錢都足夠的狀況下，真的比較推薦OSCP，畢竟臺灣我覺得應該很少人知道這張，實際上要找工作我也不太確定助益大不大，因為我也還沒開始找工作，但如果是不太知道該怎麼入門的，有錢的話考這張就對了。 謝謝大家看完這篇心得文。這篇應該是臺灣第一篇eJPT的心得文，ㄏ。如果有任何問題歡迎私訊facebook問我哦。","link":"/2020/08/07/ejpt_review/"}],"tags":[{"name":"cert review","slug":"cert-review","link":"/tags/cert-review/"},{"name":"elearnsecurity","slug":"elearnsecurity","link":"/tags/elearnsecurity/"},{"name":"pentest","slug":"pentest","link":"/tags/pentest/"}],"categories":[{"name":"Certificate","slug":"Certificate","link":"/categories/Certificate/"}]}